{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "8a77807f92f26ee",
   "metadata": {},
   "source": [
    "# Tuto Neo4j\n",
    "\n",
    "Le but du tutoriel est de vous faire découvrir Neo4j, une base de données orientée graphe. Nous allons voir comment installer Neo4j, créer une base de données, insérer des données et effectuer des requêtes simples.\n",
    "\n",
    "On utilisera pour ce tutoriel un container neo4j, ainsi que le dataset suivant : [Social circles: Facebook](https://snap.stanford.edu/data/ego-Facebook.html).\n",
    "\n",
    "On utilisera les librairies python `py2neo` pour interagir avec Neo4j. Cependant, si l'envie vous vient de faire un projet en Neo4j, utilisez neomodel qui est l'ORM de Neo4j."
   ]
  },
  {
   "cell_type": "markdown",
   "id": "3d69b8f349ed2c40",
   "metadata": {},
   "source": [
    "### Qu'est ce que Neo4j ?\n",
    "\n",
    "Neo4j est une base de données orientée graphe qui permet de stocker et de manipuler des données sous forme de graphes. Un graphe est composé de nœuds (ou sommets) et de relations (ou arêtes) entre ces nœuds. Neo4j utilise le langage de requête Cypher pour interagir avec les données.\n",
    "\n",
    "Une fois que Neo4j est installé, vous pouvez accéder à l'interface web de Neo4j en ouvrant votre navigateur et en allant à l'adresse `http://localhost:7474`. Utilisez les identifiants suivant pour vous connecter : neo4j / strongpassword ."
   ]
  },
  {
   "cell_type": "markdown",
   "id": "1c5880fbeeace01f",
   "metadata": {},
   "source": [
    "### Création de la base de données\n",
    "\n",
    "Une fois connecté à l'interface web de Neo4j, vous vous retrouverez sur cette page d'accueil :\n",
    "![Page d'accueil](./images/screen_1.png \"Accueil\")\n",
    "\n",
    "On voit un prompt dans lequel on peut écrire des requêtes Cypher. Commençons par lister les bases de données existantes avec la requête suivante :\n",
    "```cypher\n",
    "SHOW DATABASES;\n",
    "```\n",
    "Combien de bases de données voyez-vous ? Par défaut, Neo4j crée une base de données nommée `neo4j`. Nous allons créer une nouvelle base de données pour notre tutoriel. Utilisez la requête suivante pour créer une base de données nommée `social` :\n",
    "```cypher\n",
    "CREATE DATABASE social;\n",
    "```"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "20d49f71",
   "metadata": {},
   "source": [
    "### Création base de données social pour le tp"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "id": "65258ae2",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<table><tr><th>address</th><th>state</th><th>message</th><th>success</th></tr><tr><td style=\"text-align:left\"></td><td style=\"text-align:left\">CaughtUp</td><td style=\"text-align:left\">No operation needed</td><td style=\"text-align:left\">true</td></tr></table>"
      ],
      "text/plain": [
       " address | state    | message             | success \n",
       "---------|----------|---------------------|---------\n",
       "         | CaughtUp | No operation needed | true    "
      ]
     },
     "execution_count": 29,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "from py2neo import Graph\n",
    "\n",
    "sys = Graph(\"bolt://neo4j:7687\", auth=(\"neo4j\", \"strongpassword\"), name=\"system\")\n",
    "sys.run(\"CREATE DATABASE social IF NOT EXISTS WAIT;\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "2996a46c1710cc3b",
   "metadata": {},
   "source": [
    "### Insertion des données\n",
    "\n",
    "On va télécharger les données via un curl, et les charger dans Neo4j avec python."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "id": "389455efffc968f8",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-18T10:34:22.211739Z",
     "start_time": "2025-11-18T10:34:22.079081Z"
    }
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "3875.68s - pydevd: Sending message related to process being replaced timed-out after 5 seconds\n",
      "--2025-11-18 11:53:19--  https://snap.stanford.edu/data/facebook.tar.gz\n",
      "Resolving snap.stanford.edu (snap.stanford.edu)... 171.64.75.80\n",
      "Connecting to snap.stanford.edu (snap.stanford.edu)|171.64.75.80|:443... 171.64.75.80\n",
      "Connecting to snap.stanford.edu (snap.stanford.edu)|171.64.75.80|:443... connected.\n",
      "connected.\n",
      "HTTP request sent, awaiting response... HTTP request sent, awaiting response... 200 OK\n",
      "Length: 732104 (715K) [application/x-gzip]\n",
      "Saving to: ‘facebook.tar.gz’\n",
      "\n",
      "facebook.tar.gz       0%[                    ]       0  --.-KB/s               200 OK\n",
      "Length: 732104 (715K) [application/x-gzip]\n",
      "Saving to: ‘facebook.tar.gz’\n",
      "\n",
      "facebook.tar.gz     100%[===================>] 714.95K   143KB/s    in 5.0s    \n",
      "\n",
      "2025-11-18 11:53:25 (143 KB/s) - ‘facebook.tar.gz’ saved [732104/732104]\n",
      "\n",
      "facebook/\n",
      "facebook/3980.egofeat\n",
      "facebook/0.featnames\n",
      "facebook/698.egofeat\n",
      "facebook/3437.feat\n",
      "facebook.tar.gz     100%[===================>] 714.95K   143KB/s    in 5.0s    \n",
      "\n",
      "2025-11-18 11:53:25 (143 KB/s) - ‘facebook.tar.gz’ saved [732104/732104]\n",
      "\n",
      "facebook/\n",
      "facebook/3980.egofeat\n",
      "facebook/0.featnames\n",
      "facebook/698.egofeat\n",
      "facebook/3437.feat\n",
      "facebook/3980.featnames\n",
      "facebook/0.edges\n",
      "facebook/3437.circles\n",
      "facebook/686.circles\n",
      "facebook/348.egofeat\n",
      "facebook/107.feat\n",
      "facebook/348.feat\n",
      "facebook/1912.circles\n",
      "facebook/3437.egofeat\n",
      "facebook/698.feat\n",
      "facebook/348.edges\n",
      "facebook/1912.feat\n",
      "facebook/414.circles\n",
      "facebook/1684.egofeat\n",
      "facebook/1684.featnames\n",
      "facebook/1684.feat\n",
      "facebook/107.egofeat\n",
      "facebook/0.circles\n",
      "facebook/414.edges\n",
      "facebook/698.featnames\n",
      "facebook/698.edges\n",
      "facebook/1912.featnames\n",
      "facebook/107.edges\n",
      "facebook/107.circles\n",
      "facebook/0.egofeat\n",
      "facebook/414.featnames\n",
      "facebook/3980.feat\n",
      "facebook/3437.featnames\n",
      "facebook/1912.egofeat\n",
      "facebook/414.egofeat\n",
      "facebook/698.circles\n",
      "facebook/348.featnames\n",
      "facebook/348.circles\n",
      "facebook/0.feat\n",
      "facebook/1684.circles\n",
      "facebook/3437.edges\n",
      "facebook/3980.edges\n",
      "facebook/686.featnames\n",
      "facebook/1912.edges\n",
      "facebook/3980.circles\n",
      "facebook/686.feat\n",
      "facebook/1684.edges\n",
      "facebook/414.feat\n",
      "facebook/686.egofeat\n",
      "facebook/107.featnames\n",
      "facebook/686.edges\n",
      "facebook/3980.featnames\n",
      "facebook/0.edges\n",
      "facebook/3437.circles\n",
      "facebook/686.circles\n",
      "facebook/348.egofeat\n",
      "facebook/107.feat\n",
      "facebook/348.feat\n",
      "facebook/1912.circles\n",
      "facebook/3437.egofeat\n",
      "facebook/698.feat\n",
      "facebook/348.edges\n",
      "facebook/1912.feat\n",
      "facebook/414.circles\n",
      "facebook/1684.egofeat\n",
      "facebook/1684.featnames\n",
      "facebook/1684.feat\n",
      "facebook/107.egofeat\n",
      "facebook/0.circles\n",
      "facebook/414.edges\n",
      "facebook/698.featnames\n",
      "facebook/698.edges\n",
      "facebook/1912.featnames\n",
      "facebook/107.edges\n",
      "facebook/107.circles\n",
      "facebook/0.egofeat\n",
      "facebook/414.featnames\n",
      "facebook/3980.feat\n",
      "facebook/3437.featnames\n",
      "facebook/1912.egofeat\n",
      "facebook/414.egofeat\n",
      "facebook/698.circles\n",
      "facebook/348.featnames\n",
      "facebook/348.circles\n",
      "facebook/0.feat\n",
      "facebook/1684.circles\n",
      "facebook/3437.edges\n",
      "facebook/3980.edges\n",
      "facebook/686.featnames\n",
      "facebook/1912.edges\n",
      "facebook/3980.circles\n",
      "facebook/686.feat\n",
      "facebook/1684.edges\n",
      "facebook/414.feat\n",
      "facebook/686.egofeat\n",
      "facebook/107.featnames\n",
      "facebook/686.edges\n"
     ]
    }
   ],
   "source": [
    "!wget https://snap.stanford.edu/data/facebook.tar.gz && tar -xvzf facebook.tar.gz && rm facebook.tar.gz"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "4f8c5248c1374fc2",
   "metadata": {},
   "source": [
    "On voit que dans le dossier facebook, on a plusieurs fichier avec des extensions différentes :\n",
    "- `.egofeat` : Caractéristiques des utilisateurs (nœuds)\n",
    "- `.edges` : Relations entre les utilisateurs (arêtes)\n",
    "- `.feat` : Caractéristiques des relations (arêtes)\n",
    "- `.featnames` : Noms des caractéristiques des relations\n",
    "- `.circles` : Cercles d'amis (groupes d'utilisateurs)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "id": "f4a7db5f265958df",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-09T15:40:08.028132Z",
     "start_time": "2025-11-09T15:40:07.962321Z"
    }
   },
   "outputs": [],
   "source": [
    "import pandas as pd\n",
    "\n",
    "# Chargement des données principales\n",
    "edges = pd.read_csv('facebook/107.edges', sep=' ', header=None, names=['source', 'target'])\n",
    "features = pd.read_csv('facebook/107.feat', sep=' ', header=None)\n",
    "# DataFrame original pour compter facilement\n",
    "featnames = pd.read_csv('facebook/107.featnames', sep=' ', header=None)\n",
    "\n",
    "feature_names = []\n",
    "with open('facebook/107.featnames', 'r') as f:\n",
    "    for line in f:\n",
    "        parts = line.strip().split(' ', 1)\n",
    "        if len(parts) == 2:\n",
    "            _, name = parts\n",
    "            feature_names.append(name.strip())\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "851d9812c8688f94",
   "metadata": {},
   "source": [
    "Combien d'arrêtes et de nœuds y a-t-il dans le graphe ? Combien de caractéristiques par nœud ?"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "id": "46a67cf86ca07278",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-09T15:41:43.646883Z",
     "start_time": "2025-11-09T15:41:43.640434Z"
    }
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "((53498, 2), (1045, 577), (576, 4))"
      ]
     },
     "execution_count": 32,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "edges.shape, features.shape, featnames.shape"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "id": "548740be82dbfd2c",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-09T16:46:29.124560Z",
     "start_time": "2025-11-09T16:46:28.447784Z"
    }
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>message</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Connected to Neo4j!</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "               message\n",
       "0  Connected to Neo4j!"
      ]
     },
     "execution_count": 33,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "from py2neo import Graph, Node\n",
    "\n",
    "graph = Graph(\"bolt://neo4j:7687\", auth=(\"neo4j\", \"strongpassword\"), name=\"social\")\n",
    "graph.run(\"RETURN 'Connected to Neo4j!' AS message\").to_data_frame()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "735fab94a04e08de",
   "metadata": {},
   "source": [
    "Ajout des noeuds dans la base de données :"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 34,
   "id": "686a1a80f83b292d",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-09T15:57:41.475405Z",
     "start_time": "2025-11-09T15:57:35.184312Z"
    }
   },
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "100%|██████████| 1045/1045 [00:23<00:00, 43.88it/s]\n",
      "100%|██████████| 1045/1045 [00:23<00:00, 43.88it/s]\n"
     ]
    }
   ],
   "source": [
    "from tqdm import tqdm\n",
    "\n",
    "for i, row in tqdm(features.iterrows(), total=features.shape[0]):\n",
    "    node_id = int(row[0])\n",
    "    node_features = {}\n",
    "    for j in range(1, len(row)):\n",
    "        key = feature_names[j-1] if j-1 < len(feature_names) else f'f{j-1}'\n",
    "        node_features[key] = int(row[j])\n",
    "    person = Node(\"Person\", id=node_id, name=str(node_id), **node_features)\n",
    "    graph.merge(person, \"Person\", \"id\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 35,
   "id": "7397dc6fbcbc06f9",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-09T16:03:23.728384Z",
     "start_time": "2025-11-09T16:03:20.233943Z"
    }
   },
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "100%|██████████| 53498/53498 [01:29<00:00, 598.23it/s]\n",
      "100%|██████████| 53498/53498 [01:29<00:00, 598.23it/s]\n"
     ]
    }
   ],
   "source": [
    "for i, row in tqdm(edges.iterrows(), total=edges.shape[0]):\n",
    "    src, dst = int(row[\"source\"]), int(row[\"target\"])\n",
    "    query = \"\"\"\n",
    "    MATCH (a:Person {id: $src}), (b:Person {id: $dst})\n",
    "    MERGE (a)-[:FRIEND_WITH]->(b)\n",
    "    \"\"\"\n",
    "    graph.run(query, src=src, dst=dst)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "9d30e57447a6b052",
   "metadata": {},
   "source": [
    "On va maintenant ajouter les cercles d'amis (107.circles), les noms des caractéristiques (107.egofeat), et les caractéristiques des relations (107.featname)."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 36,
   "id": "611cdb5c3659c251",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-09T16:13:24.530746Z",
     "start_time": "2025-11-09T16:13:23.202867Z"
    }
   },
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "100%|██████████| 576/576 [00:01<00:00, 367.86it/s]\n",
      "100%|██████████| 576/576 [00:01<00:00, 367.86it/s]\n"
     ]
    }
   ],
   "source": [
    "# Ajout des featnames :\n",
    "for i, row in tqdm(featnames.iterrows(), total=featnames.shape[0]):\n",
    "    feat_id = int(row[0])\n",
    "    feat_name = row[1]\n",
    "    feature = Node(\"Feature\", id=feat_id, name=feat_name)\n",
    "    graph.merge(feature, \"Feature\", \"id\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "d8ffe126e262600a",
   "metadata": {},
   "source": [
    "Ici on va charger les cercles dans la base de données. Comme les lignes ne sont pas de même longueur, on ne peut pas utiliser pandas."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 37,
   "id": "8e71903750910f5e",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-09T16:22:10.047524Z",
     "start_time": "2025-11-09T16:22:08.322386Z"
    }
   },
   "outputs": [],
   "source": [
    "# ajout des cercles :\n",
    "circles = []\n",
    "\n",
    "with open(\"facebook/107.circles\", \"r\") as f:\n",
    "    for line in f:\n",
    "        parts = line.strip().split()  # découpe sur les espaces ou tabulations\n",
    "        circle_name = parts[0]        # premier élément = nom du cercle\n",
    "        members = [int(x) for x in parts[1:]]  # reste = membres\n",
    "        circles.append({\"circle\": circle_name, \"members\": members})\n",
    "\n",
    "\n",
    "for c in circles:\n",
    "    circle_name = c[\"circle\"]\n",
    "    for member_id in c[\"members\"]:\n",
    "        graph.run(\"\"\"\n",
    "        MATCH (p:Person {id:$id})\n",
    "        MERGE (c:Circle {name:$circle})\n",
    "        MERGE (p)-[:IN_CIRCLE]->(c)\n",
    "        \"\"\", id=member_id, circle=circle_name)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "c9b44e0785f9e617",
   "metadata": {},
   "source": [
    "Chargement des caractéristiques des relations (107.egofeat) :"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 38,
   "id": "1eee0c646c51dc32",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-09T16:24:47.922395Z",
     "start_time": "2025-11-09T16:24:47.725287Z"
    }
   },
   "outputs": [],
   "source": [
    "with open(\"facebook/107.egofeat\", \"r\") as f:\n",
    "    for line in f:\n",
    "        parts = line.strip().split()\n",
    "        person_id = int(parts[0])\n",
    "        features_dict = {}\n",
    "        for j in range(1, len(parts)):\n",
    "            key = feature_names[j-1] if j-1 < len(feature_names) else f'f{j-1}'\n",
    "            features_dict[key] = int(parts[j])\n",
    "        query = \"\"\"\n",
    "        MATCH (p:Person {id:$id})\n",
    "        SET p += $features\n",
    "        \"\"\"\n",
    "        graph.run(query, id=person_id, features=features_dict)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "3bb38f17ab9c6f05",
   "metadata": {},
   "source": [
    "Maintenant que les données sont chargées, on peut effectuer des requêtes Cypher pour interroger la base de données. Par exemple, pour trouver tous les amis d'une personne avec l'ID 0, on peut utiliser la requête suivante :"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 39,
   "id": "f2abb03ac2ea8da0",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-09T16:27:11.348731Z",
     "start_time": "2025-11-09T16:27:11.186858Z"
    }
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>friend_id</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>58</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>171</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   friend_id\n",
       "0         58\n",
       "1        171"
      ]
     },
     "execution_count": 39,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "graph.run(\"\"\"\n",
    "MATCH (p:Person {id:0})-[:FRIEND_WITH]->(friend)\n",
    "RETURN friend.id AS friend_id\n",
    "\"\"\").to_data_frame()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "b801b4546e013f6c",
   "metadata": {},
   "source": [
    "Maintenant on va lister par ordre décroissant les personnes ayant le plus d'amis :"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 40,
   "id": "69054262d2d8906b",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-09T16:28:34.198268Z",
     "start_time": "2025-11-09T16:28:33.754528Z"
    }
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>person_id</th>\n",
       "      <th>num_friends</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1888</td>\n",
       "      <td>253</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>1800</td>\n",
       "      <td>244</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>1663</td>\n",
       "      <td>234</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>1352</td>\n",
       "      <td>233</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>1730</td>\n",
       "      <td>225</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>1431</td>\n",
       "      <td>219</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>1199</td>\n",
       "      <td>216</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>1584</td>\n",
       "      <td>210</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>1768</td>\n",
       "      <td>208</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>1589</td>\n",
       "      <td>204</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   person_id  num_friends\n",
       "0       1888          253\n",
       "1       1800          244\n",
       "2       1663          234\n",
       "3       1352          233\n",
       "4       1730          225\n",
       "5       1431          219\n",
       "6       1199          216\n",
       "7       1584          210\n",
       "8       1768          208\n",
       "9       1589          204"
      ]
     },
     "execution_count": 40,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "graph.run(\"\"\"\n",
    "MATCH (p:Person)-[:FRIEND_WITH]->(friend)\n",
    "RETURN p.id AS person_id, COUNT(friend) AS num_friends\n",
    "ORDER BY num_friends DESC\n",
    "LIMIT 10\n",
    "\"\"\").to_data_frame()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "e9bc156e0bcb708",
   "metadata": {},
   "source": [
    "### Visualisation des données dans Neo4j\n",
    "\n",
    "L'interêt de Neo4j est de pouvoir visualiser les données sous forme de graphe. Pour cela, on peut utiliser l'interface web de Neo4j. Voici comment visualiser les amis de la personne avec l'ID 0 :\n",
    "```cypher\n",
    "MATCH (p:Person {id:0})-[:FRIEND_WITH]->(friend)\n",
    "RETURN p, friend\n",
    "```\n",
    "Et voilà le résultat :\n",
    "![Visualisation des amis](./images/screen_2.png \"Amis de la personne 0\")\n",
    "\n",
    "En double cliquant sur le noeud 0, on peut voir les rélations du noeud et ses caractéristiques :\n",
    "![Détails du noeud](./images/screen_3.png \"Détails du noeud 0\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "e748d87b06b118c9",
   "metadata": {},
   "source": [
    "### Fonctions avancées de Cypher\n",
    "\n",
    "Nous allons utiliser des fonctions plus complèxes de Cypher afin de voir ce que Neo4j apporte de plus par rapport à une base de données relationnelle classique. Pour cela on va utiliser GDS (Graph Data Science) qui est un plugin de Neo4j permettant d'effectuer des analyses de graphes avancées.\n",
    "\n",
    "Questions :\n",
    "- Quel est le degré moyen des nœuds dans le graphe ?\n",
    "- Quelle est la distance moyenne entre deux nœuds dans le graphe ?\n",
    "- Quels sont les noeuds les plus influents dans le graphe (PageRank) ?\n",
    "- Quels sont les clusters dans le graphe (algorithme de Louvain) ?"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 41,
   "id": "a0afe340a84524e7",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-09T16:47:24.878487Z",
     "start_time": "2025-11-09T16:47:24.815646Z"
    }
   },
   "outputs": [
    {
     "ename": "ClientError",
     "evalue": "[Procedure.ProcedureCallFailed] Failed to invoke procedure `gds.graph.project`: Caused by: java.lang.IllegalArgumentException: A graph with name 'facebookGraph' already exists.",
     "output_type": "error",
     "traceback": [
      "\u001b[0;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[0;31mClientError\u001b[0m                               Traceback (most recent call last)",
      "Cell \u001b[0;32mIn[41], line 2\u001b[0m\n\u001b[1;32m      1\u001b[0m \u001b[38;5;66;03m# Degré moyen des nœuds\u001b[39;00m\n\u001b[0;32m----> 2\u001b[0m \u001b[43mgraph\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mrun\u001b[49m\u001b[43m(\u001b[49m\u001b[38;5;124;43m\"\"\"\u001b[39;49m\n\u001b[1;32m      3\u001b[0m \u001b[38;5;124;43mCALL gds.graph.project(\u001b[39;49m\u001b[38;5;124;43m'\u001b[39;49m\u001b[38;5;124;43mfacebookGraph\u001b[39;49m\u001b[38;5;124;43m'\u001b[39;49m\u001b[38;5;124;43m, \u001b[39;49m\u001b[38;5;124;43m'\u001b[39;49m\u001b[38;5;124;43mPerson\u001b[39;49m\u001b[38;5;124;43m'\u001b[39;49m\u001b[38;5;124;43m, \u001b[39;49m\u001b[38;5;124;43m'\u001b[39;49m\u001b[38;5;124;43mFRIEND_WITH\u001b[39;49m\u001b[38;5;124;43m'\u001b[39;49m\u001b[38;5;124;43m)\u001b[39;49m\n\u001b[1;32m      4\u001b[0m \u001b[38;5;124;43mYIELD graphName, nodeCount, relationshipCount;\u001b[39;49m\n\u001b[1;32m      5\u001b[0m \u001b[38;5;124;43m\"\"\"\u001b[39;49m\u001b[43m)\u001b[49m\u001b[38;5;241m.\u001b[39mto_data_frame()\n",
      "File \u001b[0;32m/opt/conda/lib/python3.11/site-packages/py2neo/database.py:405\u001b[0m, in \u001b[0;36mGraph.run\u001b[0;34m(self, cypher, parameters, **kwparameters)\u001b[0m\n\u001b[1;32m    395\u001b[0m \u001b[38;5;28;01mdef\u001b[39;00m \u001b[38;5;21mrun\u001b[39m(\u001b[38;5;28mself\u001b[39m, cypher, parameters\u001b[38;5;241m=\u001b[39m\u001b[38;5;28;01mNone\u001b[39;00m, \u001b[38;5;241m*\u001b[39m\u001b[38;5;241m*\u001b[39mkwparameters):\n\u001b[1;32m    396\u001b[0m \u001b[38;5;250m    \u001b[39m\u001b[38;5;124;03m\"\"\" Run a single read/write query within an auto-commit\u001b[39;00m\n\u001b[1;32m    397\u001b[0m \u001b[38;5;124;03m    :class:`~py2neo.Transaction`.\u001b[39;00m\n\u001b[1;32m    398\u001b[0m \n\u001b[0;32m   (...)\u001b[0m\n\u001b[1;32m    403\u001b[0m \u001b[38;5;124;03m    :return:\u001b[39;00m\n\u001b[1;32m    404\u001b[0m \u001b[38;5;124;03m    \"\"\"\u001b[39;00m\n\u001b[0;32m--> 405\u001b[0m     \u001b[38;5;28;01mreturn\u001b[39;00m \u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mauto\u001b[49m\u001b[43m(\u001b[49m\u001b[43m)\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mrun\u001b[49m\u001b[43m(\u001b[49m\u001b[43mcypher\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mparameters\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;241;43m*\u001b[39;49m\u001b[38;5;241;43m*\u001b[39;49m\u001b[43mkwparameters\u001b[49m\u001b[43m)\u001b[49m\n",
      "File \u001b[0;32m/opt/conda/lib/python3.11/site-packages/py2neo/database.py:992\u001b[0m, in \u001b[0;36mTransaction.run\u001b[0;34m(self, cypher, parameters, **kwparameters)\u001b[0m\n\u001b[1;32m    988\u001b[0m     \u001b[38;5;28;01melse\u001b[39;00m:\n\u001b[1;32m    989\u001b[0m         result \u001b[38;5;241m=\u001b[39m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_connector\u001b[38;5;241m.\u001b[39mauto_run(cypher, parameters,\n\u001b[1;32m    990\u001b[0m                                           graph_name\u001b[38;5;241m=\u001b[39m\u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mgraph\u001b[38;5;241m.\u001b[39mname,\n\u001b[1;32m    991\u001b[0m                                           readonly\u001b[38;5;241m=\u001b[39m\u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mreadonly)\n\u001b[0;32m--> 992\u001b[0m     \u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_connector\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mpull\u001b[49m\u001b[43m(\u001b[49m\u001b[43mresult\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;241;43m-\u001b[39;49m\u001b[38;5;241;43m1\u001b[39;49m\u001b[43m)\u001b[49m\n\u001b[1;32m    993\u001b[0m     \u001b[38;5;28;01mreturn\u001b[39;00m Cursor(result, hydrant)\n\u001b[1;32m    994\u001b[0m \u001b[38;5;28;01mfinally\u001b[39;00m:\n",
      "File \u001b[0;32m/opt/conda/lib/python3.11/site-packages/py2neo/client/__init__.py:1434\u001b[0m, in \u001b[0;36mConnector.pull\u001b[0;34m(self, result, n)\u001b[0m\n\u001b[1;32m   1432\u001b[0m cx \u001b[38;5;241m=\u001b[39m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_reacquire(result\u001b[38;5;241m.\u001b[39mtransaction)\n\u001b[1;32m   1433\u001b[0m \u001b[38;5;28;01mtry\u001b[39;00m:\n\u001b[0;32m-> 1434\u001b[0m     \u001b[43mcx\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mpull\u001b[49m\u001b[43m(\u001b[49m\u001b[43mresult\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mn\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43mn\u001b[49m\u001b[43m)\u001b[49m\n\u001b[1;32m   1435\u001b[0m \u001b[38;5;28;01mexcept\u001b[39;00m (ConnectionUnavailable, ConnectionBroken):\n\u001b[1;32m   1436\u001b[0m     \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mprune(cx\u001b[38;5;241m.\u001b[39mprofile)\n",
      "File \u001b[0;32m/opt/conda/lib/python3.11/site-packages/py2neo/client/bolt.py:1001\u001b[0m, in \u001b[0;36mBolt4x0.pull\u001b[0;34m(self, result, n, capacity)\u001b[0m\n\u001b[1;32m    998\u001b[0m     raise_from(ConnectionBroken(\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mTransaction broken by disconnection \u001b[39m\u001b[38;5;124m\"\u001b[39m\n\u001b[1;32m    999\u001b[0m                                 \u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mduring pull\u001b[39m\u001b[38;5;124m\"\u001b[39m), error)\n\u001b[1;32m   1000\u001b[0m \u001b[38;5;28;01melse\u001b[39;00m:\n\u001b[0;32m-> 1001\u001b[0m     \u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_audit\u001b[49m\u001b[43m(\u001b[49m\u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_transaction\u001b[49m\u001b[43m)\u001b[49m\n\u001b[1;32m   1002\u001b[0m     \u001b[38;5;28;01mreturn\u001b[39;00m response\n",
      "File \u001b[0;32m/opt/conda/lib/python3.11/site-packages/py2neo/client/bolt.py:810\u001b[0m, in \u001b[0;36mBolt1._audit\u001b[0;34m(self, task)\u001b[0m\n\u001b[1;32m    808\u001b[0m     \u001b[38;5;28;01mreturn\u001b[39;00m\n\u001b[1;32m    809\u001b[0m \u001b[38;5;28;01mtry\u001b[39;00m:\n\u001b[0;32m--> 810\u001b[0m     \u001b[43mtask\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43maudit\u001b[49m\u001b[43m(\u001b[49m\u001b[43m)\u001b[49m\n\u001b[1;32m    811\u001b[0m \u001b[38;5;28;01mexcept\u001b[39;00m Neo4jError:\n\u001b[1;32m    812\u001b[0m     \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mreset(force\u001b[38;5;241m=\u001b[39m\u001b[38;5;28;01mTrue\u001b[39;00m)\n",
      "File \u001b[0;32m/opt/conda/lib/python3.11/site-packages/py2neo/client/bolt.py:1140\u001b[0m, in \u001b[0;36mItemizedTask.audit\u001b[0;34m(self)\u001b[0m\n\u001b[1;32m   1138\u001b[0m \u001b[38;5;28;01mdef\u001b[39;00m \u001b[38;5;21maudit\u001b[39m(\u001b[38;5;28mself\u001b[39m):\n\u001b[1;32m   1139\u001b[0m     \u001b[38;5;28;01mfor\u001b[39;00m item \u001b[38;5;129;01min\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_items:\n\u001b[0;32m-> 1140\u001b[0m         \u001b[43mitem\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43maudit\u001b[49m\u001b[43m(\u001b[49m\u001b[43m)\u001b[49m\n",
      "File \u001b[0;32m/opt/conda/lib/python3.11/site-packages/py2neo/client/bolt.py:1140\u001b[0m, in \u001b[0;36mItemizedTask.audit\u001b[0;34m(self)\u001b[0m\n\u001b[1;32m   1138\u001b[0m \u001b[38;5;28;01mdef\u001b[39;00m \u001b[38;5;21maudit\u001b[39m(\u001b[38;5;28mself\u001b[39m):\n\u001b[1;32m   1139\u001b[0m     \u001b[38;5;28;01mfor\u001b[39;00m item \u001b[38;5;129;01min\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_items:\n\u001b[0;32m-> 1140\u001b[0m         \u001b[43mitem\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43maudit\u001b[49m\u001b[43m(\u001b[49m\u001b[43m)\u001b[49m\n",
      "File \u001b[0;32m/opt/conda/lib/python3.11/site-packages/py2neo/client/bolt.py:1303\u001b[0m, in \u001b[0;36mBoltResponse.audit\u001b[0;34m(self)\u001b[0m\n\u001b[1;32m   1301\u001b[0m \u001b[38;5;28;01mif\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_failure:\n\u001b[1;32m   1302\u001b[0m     \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mset_ignored()\n\u001b[0;32m-> 1303\u001b[0m     \u001b[38;5;28;01mraise\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_failure\n",
      "\u001b[0;31mClientError\u001b[0m: [Procedure.ProcedureCallFailed] Failed to invoke procedure `gds.graph.project`: Caused by: java.lang.IllegalArgumentException: A graph with name 'facebookGraph' already exists."
     ]
    }
   ],
   "source": [
    "# Degré moyen des nœuds\n",
    "graph.run(\"\"\"\n",
    "CALL gds.graph.project('facebookGraph', 'Person', 'FRIEND_WITH')\n",
    "YIELD graphName, nodeCount, relationshipCount;\n",
    "\"\"\").to_data_frame()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "f560550644bbff12",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-09T16:47:18.213895Z",
     "start_time": "2025-11-09T16:47:18.131372Z"
    }
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>average_degree</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>51.194258</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   average_degree\n",
       "0       51.194258"
      ]
     },
     "execution_count": 24,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "graph.run(\"\"\"\n",
    "CALL gds.degree.stream('facebookGraph')\n",
    "YIELD nodeId, score\n",
    "RETURN avg(score) AS average_degree;\n",
    "\"\"\").to_data_frame()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "ebe902d53e25aed7",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-09T16:48:09.914008Z",
     "start_time": "2025-11-09T16:48:09.294159Z"
    }
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>average_distance</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>2.951676</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   average_distance\n",
       "0          2.951676"
      ]
     },
     "execution_count": 25,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Distance moyenne entre deux nœuds\n",
    "graph.run(\"\"\"\n",
    "CALL gds.alpha.allShortestPaths.stream('facebookGraph')\n",
    "YIELD sourceNodeId, targetNodeId, distance\n",
    "RETURN avg(distance) AS average_distance;\n",
    "\"\"\").to_data_frame()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "a88e79f688f0d9d3",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-09T16:50:39.342352Z",
     "start_time": "2025-11-09T16:50:38.926444Z"
    }
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>person_id</th>\n",
       "      <th>score</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>483</td>\n",
       "      <td>3.634887</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>917</td>\n",
       "      <td>2.956809</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>1888</td>\n",
       "      <td>2.753837</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>1800</td>\n",
       "      <td>2.706385</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>1783</td>\n",
       "      <td>2.621760</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>1352</td>\n",
       "      <td>2.608647</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>1431</td>\n",
       "      <td>2.585110</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>1663</td>\n",
       "      <td>2.584852</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>1086</td>\n",
       "      <td>2.580798</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>1730</td>\n",
       "      <td>2.571580</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   person_id     score\n",
       "0        483  3.634887\n",
       "1        917  2.956809\n",
       "2       1888  2.753837\n",
       "3       1800  2.706385\n",
       "4       1783  2.621760\n",
       "5       1352  2.608647\n",
       "6       1431  2.585110\n",
       "7       1663  2.584852\n",
       "8       1086  2.580798\n",
       "9       1730  2.571580"
      ]
     },
     "execution_count": 26,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#Quels sont les noeuds les plus influents dans le graphe ?\n",
    "\n",
    "graph.run(\"\"\"\n",
    "CALL gds.pageRank.stream('facebookGraph')\n",
    "YIELD nodeId, score\n",
    "RETURN gds.util.asNode(nodeId).id AS person_id, score\n",
    "ORDER BY score DESC\n",
    "LIMIT 10;\n",
    "\"\"\").to_data_frame()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "8c3e021f28075c11",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-09T16:51:06.756851Z",
     "start_time": "2025-11-09T16:51:02.549818Z"
    }
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>person_id</th>\n",
       "      <th>communityId</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>911</td>\n",
       "      <td>15</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>918</td>\n",
       "      <td>22</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>992</td>\n",
       "      <td>120</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>958</td>\n",
       "      <td>120</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>901</td>\n",
       "      <td>120</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>987</td>\n",
       "      <td>120</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>903</td>\n",
       "      <td>120</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>938</td>\n",
       "      <td>120</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>963</td>\n",
       "      <td>120</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>1097</td>\n",
       "      <td>120</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   person_id  communityId\n",
       "0        911           15\n",
       "1        918           22\n",
       "2        992          120\n",
       "3        958          120\n",
       "4        901          120\n",
       "5        987          120\n",
       "6        903          120\n",
       "7        938          120\n",
       "8        963          120\n",
       "9       1097          120"
      ]
     },
     "execution_count": 27,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#Quels sont les clusters dans le graphe (algorithme de Louvain) ?\n",
    "\n",
    "graph.run(\"\"\"\n",
    "CALL gds.louvain.stream('facebookGraph')\n",
    "YIELD nodeId, communityId\n",
    "RETURN gds.util.asNode(nodeId).id AS person_id, communityId\n",
    "ORDER BY communityId\n",
    "LIMIT 10;\n",
    "\"\"\").to_data_frame()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "7c1de441b606c920",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
